#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2026l-325157/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2026l-325157/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2026l-325157-data]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2026l-325157-code]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2026l-325157"/regions/"europe-west1"/zones/<null>]
google_compute_firewall.allow-internal-icmp: Refreshing state... [id=projects/tbd-2026l-325157/global/firewalls/allow-internal-icmp]
google_compute_firewall.allow-internal-tcp: Refreshing state... [id=projects/tbd-2026l-325157/global/firewalls/allow-internal-tcp]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2026l-325157/global/firewalls/default-internal-allow-all]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2026l-325157/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2026l-325157/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2026l-325157/global/firewalls/fw-allow-ingress-iap]
google_compute_firewall.allow-internal-udp: Refreshing state... [id=projects/tbd-2026l-325157/global/firewalls/allow-internal-udp]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2026l-325157-code-spark-job.py]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2026l-325157/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2026l-325157/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2026l-325157/dataproc.googleapis.com]
module.dataproc.google_service_account.dataproc_sa: Refreshing state... [id=projects/tbd-2026l-325157/serviceAccounts/tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket.dataproc_temp: Refreshing state... [id=tbd-2026l-325157-dataproc-temp]
module.dataproc.google_storage_bucket.dataproc_staging: Refreshing state... [id=tbd-2026l-325157-dataproc-staging]
module.airflow.google_service_account.airflow_sa: Refreshing state... [id=projects/tbd-2026l-325157/serviceAccounts/tbd-2026l-325157-airflow-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.airflow.google_project_service.container: Refreshing state... [id=tbd-2026l-325157/container.googleapis.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_user: Refreshing state... [id=tbd-2026l-325157/roles/bigquery.user/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.temp_bucket_iam: Refreshing state... [id=b/tbd-2026l-325157-dataproc-temp/roles/storage.objectAdmin/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_data_editor: Refreshing state... [id=tbd-2026l-325157/roles/bigquery.dataEditor/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_worker: Refreshing state... [id=tbd-2026l-325157/roles/dataproc.worker/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2026l-325157-code/roles/storage.objectViewer/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2026l-325157-data/roles/storage.objectUser/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.airflow.google_project_iam_member.airflow_storage: Refreshing state... [id=tbd-2026l-325157/roles/storage.objectViewer/serviceAccount:tbd-2026l-325157-airflow-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.airflow.google_project_iam_member.airflow_dataproc_editor: Refreshing state... [id=tbd-2026l-325157/roles/dataproc.editor/serviceAccount:tbd-2026l-325157-airflow-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.airflow.google_project_iam_member.airflow_sa_user: Refreshing state... [id=tbd-2026l-325157/roles/iam.serviceAccountUser/serviceAccount:tbd-2026l-325157-airflow-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.staging_bucket_iam: Refreshing state... [id=b/tbd-2026l-325157-dataproc-staging/roles/storage.objectAdmin/serviceAccount:tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2026l-325157/locations/europe/repositories/eu.gcr.io]
module.airflow.google_container_cluster.airflow: Refreshing state... [id=projects/tbd-2026l-325157/locations/europe-west1-b/clusters/airflow-cluster]
module.airflow.google_container_node_pool.airflow_nodes: Refreshing state... [id=projects/tbd-2026l-325157/locations/europe-west1-b/clusters/airflow-cluster/nodePools/airflow-pool]
kubernetes_namespace.airflow: Refreshing state... [id=airflow]
kubernetes_service.airflow_pg: Refreshing state... [id=airflow/airflow-pg]
kubernetes_stateful_set.airflow_pg: Refreshing state... [id=airflow/airflow-pg]
kubernetes_job.airflow_db_migrate: Refreshing state... [id=airflow/airflow-db-migrate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.airflow will be created
  + resource "helm_release" "airflow" {
      + atomic                     = false
      + chart                      = "airflow"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "airflow"
      + namespace                  = "airflow"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://airflow.apache.org"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "1.16.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "dags.gitSync.branch"
          + value = "master"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "dags.gitSync.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "dags.gitSync.repo"
          + value = "https://github.com/mGarbowski/tbd-workshop-1.git"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "dags.gitSync.subPath"
          + value = "modules/data-pipeline/resources"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "dags.gitSync.wait"
          + value = "60"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "dags.persistence.enabled"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "data.metadataConnection.db"
          + value = "airflow"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "data.metadataConnection.host"
          + value = "airflow-pg"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "data.metadataConnection.user"
          + value = "postgres"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].name"
          + value = "AIRFLOW_VAR_PROJECT_ID"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].value"
          + value = "tbd-2026l-325157"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[1].name"
          + value = "AIRFLOW_VAR_REGION_NAME"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[1].value"
          + value = "europe-west1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[2].name"
          + value = "AIRFLOW_VAR_BUCKET_NAME"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[2].value"
          + value = "tbd-2026l-325157-code"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[3].name"
          + value = "AIRFLOW_VAR_PHS_CLUSTER"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[3].value"
          + value = "tbd-cluster"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "executor"
          + value = "LocalExecutor"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "postgresql.enabled"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "scheduler.resources.requests.cpu"
          + value = "250m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "scheduler.resources.requests.memory"
          + value = "512Mi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "triggerer.resources.requests.cpu"
          + value = "250m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "triggerer.resources.requests.memory"
          + value = "256Mi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "webserver.resources.requests.cpu"
          + value = "250m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "webserver.resources.requests.memory"
          + value = "512Mi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "webserver.service.type"
          + value = "LoadBalancer"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "webserver.startupProbe.failureThreshold"
          + value = "12"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "webserver.startupProbe.periodSeconds"
          + value = "15"
            # (1 unchanged attribute hidden)
        }

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # kubernetes_job.airflow_create_user will be created
  + resource "kubernetes_job" "airflow_create_user" {
      + id                  = (known after apply)
      + wait_for_completion = true

      + metadata {
          + generation       = (known after apply)
          + labels           = (known after apply)
          + name             = "airflow-create-user"
          + namespace        = "airflow"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backoff_limit   = 2
          + completion_mode = (known after apply)
          + completions     = 1
          + parallelism     = 1

          + selector (known after apply)

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Never"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + command                    = [
                          + "airflow",
                          + "users",
                          + "create",
                          + "--username",
                          + "admin",
                          + "--password",
                          + (sensitive value),
                          + "--firstname",
                          + "Admin",
                          + "--lastname",
                          + "User",
                          + "--role",
                          + "Admin",
                          + "--email",
                          + "admin@example.com",
                        ]
                      + image                      = "apache/airflow:2.10.5"
                      + image_pull_policy          = (known after apply)
                      + name                       = "create-user"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "AIRFLOW__DATABASE__SQL_ALCHEMY_CONN"
                          + value = (sensitive value)
                        }

                      + resources (known after apply)
                    }

                  + image_pull_secrets (known after apply)

                  + readiness_gate (known after apply)
                }
            }
        }

      + timeouts {
          + create = "5m"
        }
    }

  # kubernetes_job.airflow_gcp_connection will be created
  + resource "kubernetes_job" "airflow_gcp_connection" {
      + id                  = (known after apply)
      + wait_for_completion = true

      + metadata {
          + generation       = (known after apply)
          + labels           = (known after apply)
          + name             = "airflow-gcp-connection"
          + namespace        = "airflow"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backoff_limit   = 2
          + completion_mode = (known after apply)
          + completions     = 1
          + parallelism     = 1

          + selector (known after apply)

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Never"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + command                    = [
                          + "airflow",
                          + "connections",
                          + "add",
                          + "google_cloud_default",
                          + "--conn-type",
                          + "google_cloud_platform",
                          + "--conn-extra",
                          + jsonencode(
                                {
                                  + project = "tbd-2026l-325157"
                                }
                            ),
                        ]
                      + image                      = "apache/airflow:2.10.5"
                      + image_pull_policy          = (known after apply)
                      + name                       = "create-connection"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "AIRFLOW__DATABASE__SQL_ALCHEMY_CONN"
                          + value = (sensitive value)
                        }

                      + resources (known after apply)
                    }

                  + image_pull_secrets (known after apply)

                  + readiness_gate (known after apply)
                }
            }
        }

      + timeouts {
          + create = "5m"
        }
    }

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster will be created
  + resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      + effective_labels              = (known after apply)
      + graceful_decommission_timeout = "0s"
      + id                            = (known after apply)
      + name                          = "tbd-cluster"
      + project                       = "tbd-2026l-325157"
      + region                        = "europe-west1"
      + terraform_labels              = (known after apply)

      + cluster_config {
          + bucket         = (known after apply)
          + staging_bucket = "tbd-2026l-325157-dataproc-staging"
          + temp_bucket    = "tbd-2026l-325157-dataproc-temp"

          + auxiliary_node_groups (known after apply)

          + dataproc_metric_config (known after apply)

          + endpoint_config {
              + enable_http_port_access = true
              + http_ports              = (known after apply)
            }

          + gce_cluster_config {
              + internal_ip_only       = true
              + metadata               = {
                  + "PIP_PACKAGES" = "pandas<2 mlflow==2.3.1 google-cloud-storage==2.9.0 jupyterlab==3.6.3 dbt-core==1.8.7 dbt-spark==1.8.0"
                  + "vmDnsSetting" = "GlobalDefault"
                }
              + network                = (known after apply)
              + service_account        = "tbd-2026l-325157-dataproc-sa@tbd-2026l-325157.iam.gserviceaccount.com"
              + service_account_scopes = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + subnetwork             = "projects/tbd-2026l-325157/regions/europe-west1/subnetworks/subnet-01"
              + zone                   = (known after apply)

              + node_group_affinity (known after apply)

              + reservation_affinity (known after apply)

              + shielded_instance_config (known after apply)
            }

          + initialization_action {
              + script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh"
              + timeout_sec = 600
            }

          + master_config {
              + image_uri        = (known after apply)
              + instance_names   = (known after apply)
              + machine_type     = "e2-standard-2"
              + min_cpu_platform = (known after apply)
              + num_instances    = 1

              + disk_config {
                  + boot_disk_size_gb = 10
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }

          + preemptible_worker_config {
              + instance_names = (known after apply)
              + num_instances  = 2
              + preemptibility = "PREEMPTIBLE"

              + disk_config {
                  + boot_disk_size_gb = 10
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }

              + instance_flexibility_policy (known after apply)
            }

          + software_config {
              + image_version       = "2.2.69-ubuntu22"
              + optional_components = [
                  + "JUPYTER",
                ]
              + properties          = (known after apply)
            }

          + worker_config {
              + image_uri         = (known after apply)
              + instance_names    = (known after apply)
              + machine_type      = "e2-standard-2"
              + min_cpu_platform  = (known after apply)
              + min_num_instances = (known after apply)
              + num_instances     = 0

              + disk_config (known after apply)
            }
        }

      + virtual_cluster_config (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mGarbowski, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*